In [1]:
import pandas as pd
import numpy as np

In [2]:
ls

'Data Exploration.html'              train_predictdata.csv
'Data Exploration.ipynb'            'Transactional data.xlsx'
 README.md                           Transactional.html
 sample_submission_predictdata.csv   Transactional.ipynb
 test_predictdata.csv

In [3]:
df = pd.read_excel('Transactional data.xlsx',sheet_name="input",skiprows=1)

In [4]:
df.columns

Index(['Customer ID', 'Time stamp', 'Product Name', 'Unnamed: 3'], dtype='object')

# Removing column

In [5]:
# Removing column
# axis=0 row axis
# axis=1 column axis
# inplace=True to effect change
df.drop('Unnamed: 3', axis=1, inplace=True)

In [5]:
# Removing columns
list_drop = ['Unnamed: 3']
df.drop(list_drop, axis=1, inplace=True)

In [6]:
df.head()

   Customer ID          Time stamp            Product Name
0          147 2015-04-13 16:01:07         Cricket Bat MRF
1          151 2015-04-15 11:00:55  Badminton Racket Yonex
2          142 2015-03-11 14:53:04      Feather Ball Yonex
3          132 2015-06-11 13:20:07    Tennis Racket Wilson
4          186 2015-04-20 17:24:56                 Helmet

In [7]:
df1 = df.copy()

In [8]:
df2 = df.copy()

In [12]:
df3 = df.copy()

# Removing Row

In [10]:
# Removing rows 0 and 1
# axis=0 is the default, so technically, you can leave this out
rows = [0,1]
df3.drop(rows, axis=0,inplace=True)

In [11]:
df3.head()

   Customer ID          Time stamp            Product Name
2          142 2015-03-11 14:53:04      Feather Ball Yonex
3          132 2015-06-11 13:20:07    Tennis Racket Wilson
4          186 2015-04-20 17:24:56                 Helmet
5          123 2015-06-28 15:14:39         Cricket Bat MRF
6          152 2015-05-09 13:19:43  Badminton Racket Yonex

# Renaming columns in a pandas DataFrame

# Method 1: Renaming a single column

In [13]:
# inplace=True to affect DataFrame
df1.rename(columns={'Customer ID':'Customer_ID'},inplace =True)

In [14]:
df1.head()

   Customer_ID          Time stamp            Product Name
0          147 2015-04-13 16:01:07         Cricket Bat MRF
1          151 2015-04-15 11:00:55  Badminton Racket Yonex
2          142 2015-03-11 14:53:04      Feather Ball Yonex
3          132 2015-06-11 13:20:07    Tennis Racket Wilson
4          186 2015-04-20 17:24:56                 Helmet

In [15]:
# Method 2: Renaming multiple columns
df1_cols = ['Customer_ID','Time_stamp', 'Product_Name']

In [16]:
df1.columns =df1_cols

In [18]:
df1.iloc[:,:].columns = df1_cols

In [19]:
df1.head()

   Customer_ID          Time_stamp            Product_Name
0          147 2015-04-13 16:01:07         Cricket Bat MRF
1          151 2015-04-15 11:00:55  Badminton Racket Yonex
2          142 2015-03-11 14:53:04      Feather Ball Yonex
3          132 2015-06-11 13:20:07    Tennis Racket Wilson
4          186 2015-04-20 17:24:56                 Helmet

In [ ]:
# Method 3: Change columns while reading
# df2 = pd.read_excel('Transactional data.xlsx', names = df1_cols, inplace =True, )

In [41]:
df2 = df.copy()

In [44]:
# Method 4: Replacing spaces with underscores for all columns
# If you have a 100 columns, some had spaces in them and you want to replace all the spaces with underscores
df2.columns = df2.columns.str.replace(' ','_')

In [45]:
df2.head()

   Customer_ID          Time_stamp            Product_Name
0          147 2015-04-13 16:01:07         Cricket Bat MRF
1          151 2015-04-15 11:00:55  Badminton Racket Yonex
2          142 2015-03-11 14:53:04      Feather Ball Yonex
3          132 2015-06-11 13:20:07    Tennis Racket Wilson
4          186 2015-04-20 17:24:56                 Helmet

In [66]:
df2.head()

   Customer_ID          Time_stamp            Product_Name  Year
0          147 2015-04-13 16:01:07         Cricket Bat MRF  2015
1          151 2015-04-15 11:00:55  Badminton Racket Yonex  2015
2          142 2015-03-11 14:53:04      Feather Ball Yonex  2015
3          132 2015-06-11 13:20:07    Tennis Racket Wilson  2015
4          186 2015-04-20 17:24:56                 Helmet   2015

# "The Total Number of  each Product every Customer Bought in 2015

In [46]:
df2['Product_Name'].value_counts()

Cricket Bat MRF           527
Badminton Racket Yonex    499
Feather Ball Yonex        482
Tennis Racket Wilson      249
Helmet                    241
Name: Product_Name, dtype: int64

Using "groupby" in pandas

In [69]:
df2.Product_Name.groupby(df2.Product_Name).count()

Product_Name
Badminton Racket Yonex    499
Cricket Bat MRF           527
Feather Ball Yonex        482
Helmet                    241
Tennis Racket Wilson      249
Name: Product_Name, dtype: int64

# 1. Number of times customer 128 purchased

In [72]:
total_purchased = df2.Customer_ID[df2.Customer_ID==128].count()
print('Number of times customer 128 purchased:', total_purchased)

Number of times customer 128 purchased: 17

# 2.Number of customers who bought Cricket Bat MRF  also bought Tennis Racket Wilson in entire time period

In [92]:
cricket =df2.Customer_ID[df2.Product_Name=='Cricket Bat MRF'].re
badminton=df2[df2.Product_Name=='Badminton Racket Yonex']
# no_of_customer= pd.merge(cricket,badminton, how='inner',on=['Customer_ID','Product_Name'])

In [93]:
cricket

152    12
138    10
149    10
167    10
130     9
       ..
179     2
121     1
154     1
195     1
122     1
Name: Customer_ID, Length: 100, dtype: int64

In [89]:
badminton

(0, 6)

In [29]:
from datetime import date

In [50]:
df2.Time_stamp.dtypes

dtype('<M8[ns]')

In [52]:
df2['Year'] = df2.Time_stamp.apply(lambda x: x.strftime('%Y'))

In [55]:
df2.head()

   Customer_ID          Time_stamp            Product_Name  Year
0          147 2015-04-13 16:01:07         Cricket Bat MRF  2015
1          151 2015-04-15 11:00:55  Badminton Racket Yonex  2015
2          142 2015-03-11 14:53:04      Feather Ball Yonex  2015
3          132 2015-06-11 13:20:07    Tennis Racket Wilson  2015
4          186 2015-04-20 17:24:56                 Helmet   2015

In [ ]:
temp2 = df_train.pivot_table(values='Loan_Status',index=['Credit_History'],aggfunc=lambda x: x.map({'Y':1,'N':0}).mean())

In [61]:
sales = pd.pivot_table(df2,index=['Year'],aggfunc=np.count())

AttributeError: module 'numpy' has no attribute 'count'